Correctifier/pupa2/target/bsp/stm32/clock.cpp
#include "clock.hpp"

#include "profiler.hpp"
#include "stm32g4xx_hal.h"

namespace {
[[noreturn]] void clock_failure() {
  __disable_irq();

  while (true) {
    __WFI();
  }
}

void configure_clock() {
  __HAL_RCC_PWR_CLK_ENABLE();

  // HSI16 / 4 * 85 / 2 = 170 MHz; no external oscillator is required.
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST) != HAL_OK) {
    clock_failure();
  }

  RCC_OscInitTypeDef oscillator{};
  oscillator.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  oscillator.HSIState = RCC_HSI_ON;
  oscillator.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  oscillator.PLL.PLLState = RCC_PLL_ON;
  oscillator.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  oscillator.PLL.PLLM = RCC_PLLM_DIV4;
  oscillator.PLL.PLLN = 85;
  oscillator.PLL.PLLP = RCC_PLLP_DIV2;
  oscillator.PLL.PLLQ = RCC_PLLQ_DIV2;
  oscillator.PLL.PLLR = RCC_PLLR_DIV2;

  if (HAL_RCC_OscConfig(&oscillator) != HAL_OK) {
    clock_failure();
  }

  RCC_ClkInitTypeDef clocks{};
  clocks.ClockType =
      RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  clocks.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  clocks.AHBCLKDivider = RCC_SYSCLK_DIV1;
  clocks.APB1CLKDivider = RCC_HCLK_DIV1;
  clocks.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&clocks, FLASH_LATENCY_8) != HAL_OK) {
    clock_failure();
  }
}
}  // namespace

extern "C" void SysTick_Handler() {
  pickup::bsp::stm32::profile::start(pickup::bsp::stm32::ProfileId::systick);
  HAL_IncTick();
  pickup::bsp::stm32::profile::stop(pickup::bsp::stm32::ProfileId::systick);
}

namespace pickup::bsp::stm32 {
void initialize_clock() {
  if (HAL_Init() != HAL_OK) {
    clock_failure();
  }

  configure_clock();
}
}  // namespace pickup::bsp::stm32
